{"pageProps":{"data":"# YourJustice WhitePaper\r\n\r\n<Paragraph className=\"subtitle\">*We are building a bridge of justice to a fairer world. Join the game-changing project and create sovereignty and freedom for Humanity.*</Paragraph>\r\n\r\n## Jurisdictions, Based on Your Own Values\r\n\r\nOnline tribes are built on values principles, not nationality.\r\n\r\n* Social rating as a humanity metric\r\n* Core values declared by communities, companies, states  and individuals\r\n* Easy search of like-minded people, community members, customers and providers, staff, citizens or netizens\r\n\r\n#### History\r\n\r\nIn the 21st century people want a fairer world liberated from violence, despotism and parasitism. A world full of freedom and safety of our lives and property.\r\n\r\nWe live in the era of virtual communities, geo-independence, cross-border interactions entering a whole new world of hybrid realities. Conservative legislation systems can't offer fast and affordable conflict resolution for this emerging diversity of human relations. Millions of people live with their own traumas and pains unspoken.\r\n\r\n#### Bitcoin As A State Transition System\r\n\r\nFrom a technical standpoint, the ledger of a cryptocurrency such as Bitcoin can be thought of as a state transition system, where there is a \"state\" consisting of the ownership status of all existing bitcoins and a <Link className=\"inline\" to=\"/\">\"state transition function\"</Link> that takes a state and a transaction and outputs a new state which is the result. In a standard banking system, for example, the state is a balance sheet, a transaction is a request to move $X from A to B, and the state transition function reduces the value in A's account by $X and increases the value in B's account by $X. If A's account has less than $X in the first place, the state transition function returns an error. Hence, one can formally define:\r\n\r\n<Code>APPLY(S,TX) -> S' or ERROR</Code>\r\n\r\nIn the banking system defined above:\r\n\r\n<Code>APPLY({ Alice: $50, Bob: $50 },\"send $20 from Alice to Bob\") = { Alice: $30, Bob: $70 }</Code>\r\n\r\n## Social Rating & Justice on Blockchain\r\n\r\n#### Scripting\r\n\r\n* **Namecoin** — created in 2010, Namecoin is best described as a decentralized name registration database. In decentralized protocols like Tor, Bitcoin and BitMessage, there needs to be some way of identifying accounts so that other people can interact with them, but in all existing solutions the only kind of identifier available is a pseudorandom hash like `1LW79wp5ZBqaHW1jL5TCiBCrhQYtHagUWy` Ideally, one would like to be able to have an account with a name like \"george\". However, the problem is that if one person can create an account named \"george\" then someone else can use the same process to register \"george\" for themselves as well and impersonate them. The only solution is a first-to-file paradigm, where the first registerer succeeds and the second fails - a problem perfectly suited for the Bitcoin consensus protocol. Namecoin is the oldest, and most successful, implementation of a name registration system using such an idea.\r\n* **Colored coins** — the purpose of colored coins is to serve as a protocol to allow people to create their own digital currencies - or, in the important trivial case of a currency with one unit, digital tokens, on the <Link className=\"inline\" to=\"https://www.blockchain.com/ru/explorer\">Bitcoin blockchain</Link>. In the colored coins protocol, one \"issues\" a new currency by publicly assigning a color to a specific Bitcoin UTXO, and the protocol recursively defines the color of other UTXO to be the same as the color of the inputs that the transaction creating them spent (some special rules apply in the case of mixed-color inputs). This allows users to maintain wallets containing only UTXO of a specific color and send them around much like regular bitcoins, backtracking through the blockchain to determine the color of any UTXO that they receive.\r\n* **Metacoins** — the idea behind a metacoin is to have a protocol that lives on top of Bitcoin, using Bitcoin transactions to store metacoin transactions but having a different state transition function, APPLY'. Because the metacoin protocol cannot prevent invalid metacoin transactions from appearing in the Bitcoin blockchain, a rule is added that if APPLY'(S,TX) returns an error, the protocol defaults to APPLY'(S,TX) = S. This provides an easy mechanism for creating an arbitrary cryptocurrency protocol, potentially with advanced features that cannot be implemented inside of Bitcoin itself, but with a very low development cost since the complexities of mining and networking are already handled by the Bitcoin protocol. Metacoins have been used to implement some classes of financial contracts, name registration and decentralized exchange.\r\n\r\n<Table>\r\n|Group|At launch|After 1 year|After 5 year|\r\n|-----|---------|------------|------------|\r\n|Currency units|1.198X|1.458X|2.498X|\r\n|Purchasers|83 %|64 %|38 %|\r\n|Reserve spent pre-sale|8 %|6 %|3 %|\r\n|Reserve used post-sale|8 %|6 %|3 %|\r\n|Miners|0 %|17 %|52 %|\r\n</Table>\r\n\r\n## Notes and Further Reading\r\n\r\n#### Notes\r\n\r\n1. A sophisticated reader may notice that in fact a Bitcoin address is the hash of the elliptic curve public key, and not the public key itself. However, it is in fact perfectly legitimate cryptographic terminology to refer to the pubkey hash as a public key itself. This is because Bitcoin's cryptography can be considered to be a custom digital signature algorithm, where the public key consists of the hash of the ECC pubkey, the signature consists of the ECC pubkey concatenated with the ECC signature, and the verification algorithm involves checking the ECC pubkey in the signature against the ECC pubkey hash provided as a public key and then verifying the ECC signature against the ECC pubkey.\r\n2. Technically, the median of the 11 previous blocks.\r\n3. Internally, 2 and \"CHARLIE\" are both numbers, with the latter being in big-endian base 256 representation. Numbers can be at least 0 and at most 2256-1.\r\n\r\n#### Further Reading\r\n\r\n1. [Intrinsic value](/)\r\n2. [Smart property](/)\r\n3. [Smart contracts](/)\r\n4. [B-money](/)\r\n5. [Reusable proofs of work](/)\r\n6. [Bitcoin whitepaper](/)\r\n7. [Namecoin](/)\r\n8. [Zooko's triangle](/)\r\n","nav":{"structure":[1,4,6],"anchors":{"1":{"link":"jurisdictions-based-on-your-own-values","text":"Jurisdictions, Based on Your Own Values","inners":[2,3]},"2":{"link":"history","text":"History"},"3":{"link":"bitcoin-as-a-state-transition-system","text":"Bitcoin As A State Transition System"},"4":{"link":"social-rating--justice-on-blockchain","text":"Social Rating & Justice on Blockchain","inners":[5]},"5":{"link":"scripting","text":"Scripting"},"6":{"link":"notes-and-further-reading","text":"Notes and Further Reading","inners":[7,8]},"7":{"link":"notes","text":"Notes"},"8":{"link":"further-reading","text":"Further Reading"}}}},"__N_SSG":true}